fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРаботы/ВКМ_ЗаполнениеГрафикаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафикаРаботы</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>Дней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРаботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРаботы) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
	Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.Дней = 0;
			Иначе
				Запись.Дней = 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = Дат;
				НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.Дней = 0;
				Иначе
					НоваяЗапись.Дней = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла;
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.Дней = 0;
				Иначе
					Запись.Дней = 1;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Запись.ГрафикРаботы = ГрафикРаботы;
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.Дней = 0;
		Иначе
			Запись.Дней = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли
